[
  {
    "id": "veracity",
    "title": "Machine Learning Engineer",
    "company": "Veracity Protocol",
    "companyUrl": "https://veracityprotocol.org/",
    "date": "Mar 2019 – Jul 2025",
    "description": [
      "I developed and deployed cutting-edge AI solutions for visual verification and authentication of physical objects, specializing in computer vision models for PCB manipulation analysis and collectible item authentication. My expertise spans the entire ML pipeline from data processing and dataset preparation to advanced model training for material and ID card authenticity verification.",
      "I led the development and deployment of a <a href=\"https://x.com/VeracityProtocl/status/1776279388234915880\" target=\"_blank\" class=\"text-primary\">large-scale hardware scanner solution</a> for collectible cards authentication in warehouse environments, managing the complete project lifecycle including shipping, integration, remote maintenance, and monitoring. I presented solutions for PCB authentication and physical tampering detection at customer conference in San Francisco, demonstrating the commercial impact of our technology.",
      "I created extensive datasets and managed large-scale data collection efforts for training authentication models using Pandas for data processing and MongoDB for dataset management. My work involved implementing sophisticated data augmentation and filtration pipelines using Albumentations framework to ensure high-quality training data for various authentication tasks.",
      "My technical optimization work included developing and optimizing deep learning models using EfficientNet and ResNet architectures, then optimizing them with TensorRT and ONNX for high-performance inference, and specifically optimizing code for NVIDIA Jetson embedded platforms, gaining extensive experience with this edge computing ecosystem. I designed robust camera integration systems for production environments.",
      "Utilizing my hardware skills, I designed and manufactured custom camera holders and mechanical parts to industrialize our solutions. I oversaw hardware design and deployment in customer production facilities with comprehensive remote maintenance and monitoring capabilities, bridging the gap between research prototypes and production-ready systems."
    ],
    "badges": [
      "Python",
      "C++",
      "PyTorch",
      "TensorFlow",
      "OpenCV",
      "NumPy",
      "pandas",
      "TensorRT",
      "ONNX",
      "NVIDIA Jetson",
      "FastAPI",
      "Flask",
      "Docker",
      "Docker Compose",
      "AWS",
      "S3",
      "SageMaker",
      "HDR pipelines",
      "Camera calibration",
      "MongoDB",
      "Linux",
      "Git",
      "Grafana"
    ]
  },
  {
    "id": "innovatrics",
    "title": "Computer Vision & Machine Learning Engineer",
    "company": "Innovatrics",
    "companyUrl": "https://www.innovatrics.com/",
    "date": "Jan 2017 – Feb 2019",
    "description": [
        "As a core member of the AI research team, I contributed to the development of state-of-the-art face recognition algorithms and biometric identification systems using TensorFlow, PyTorch, and Caffe frameworks. My responsibilities encompassed the entire machine learning workflow, from designing robust data pipelines and curating high-quality datasets to training and optimizing advanced AI algorithms for production deployment.",
        "I played a key role in transitioning computer vision technology from research to manufacturing applications, with a particular focus on automated visual inspection systems. My most significant contribution was implementing and optimizing Mask R-CNN semantic segmentation models for defect detection in manufacturing processes, specifically for precision quality control of ID cards.",
        "This work involved extensive development of segmentation and detection algorithms and creating custom dataset management tools and annotation frameworks specifically designed for the unique requirements of our applications, contributing directly to the company's expansion into industrial AI applications."
    ],
    "badges": [
      "Python",
      "TensorFlow",
      "PyTorch",
      "Keras",
      "Face recognition",
      "Biometric identification",
      "Computer Vision",
      "Automated visual inspection",
      "Defect detection",
      "OpenCV",
      "NumPy",
      "pandas",
      "scikit-learn",
      "TensorBoard",
      "Mask R-CNN",
      "U-Net",
      "Docker",
      "Linux",
      "Git"
    ]
  },
  {
    "id": "nxp",
    "title": "Computer Vision Engineer",
    "company": "NXP Semiconductors",
    "companyUrl": "https://www.nxp.com/",
    "date": "Jul 2016 – Dec 2017",
    "description": [
        "My main responsibility was the implementation and optimization of computer-vision algorithms for embedded processors such as i.MX6 and i.MX8, primarily targeting ADAS applications. I focused on developing efficient algorithms using OpenCL (GPU) that could leverage the limited computational resources of embedded systems while integrating with camera interfaces.",
        "My biggest achievement was developing an optimized stereo-vision algorithm for depth estimation and 3D reconstruction applications, achieving state-of-the-art real-time FPS performance on an embedded GPGPU. This work involved low-level C++ optimization techniques and parallel computing strategies to maximize performance on resource-constrained hardware."
    ],
    "badges": [
      "C/C++",
      "OpenCL",
      "GPGPU",
      "OpenCV",
      "Stereo Vision",
      "3D Reconstruction",
      "CMake",
      "Linux",
      "Bash",
      "Git",
      "Cross-compilation"
    ]
  }
]

