[
  {
    "id": "veracity",
    "title": "Machine Learning Engineer",
    "company": "Veracity Protocol",
    "companyUrl": "https://veracityprotocol.org/",
    "date": "Mar 2019 – Jul 2025",
    "description": [
      "Veracity Protocol develops computer vision algorithms for visual verification and authentication of physical objects based on their microstructure. You capture a photo of an ID card and it tells you if it's authentic.",
      "As a member of the AI team, I primarily researched, developed and deployed deep learning models (like ResNet, VGG, ArcFace, transformer-based models, as well as custom architectures). Being a startup, my expertise covered the entire ML pipeline from data processing and dataset preparation to deep learning model training, deployment, and integration. I also have experience with project ownership, deployments for customers, and maintenance and updating (Docker, AWS, S3, Grafana, etc.).",
      "One of my biggest projects was leading the development and deployment of a <a href='https://x.com/VeracityProtcl/status/1776279388234915880' target='_blank' class='text-primary'>large-scale hardware scanner solution</a> for collectible cards authentication for a Fortune 500 US customer, managing the complete project lifecycle.",
      "I also presented solutions for PCB authentication and physical tampering detection at a customer conference in San Francisco, demonstrating the commercial impact of our technology and successfully delivering the POC.",
      "I regularly created extensive datasets and managed large-scale data collection efforts for training AI models. My work also involved implementing data augmentation and smart filtration pipelines to ensure high data quality.",
      "I optimized models with TensorRT and ONNX for high-performance inference and specifically optimized code for NVIDIA Jetson embedded platforms. I designed camera systems for production environments. Utilizing my hardware skills, I built a variety of hardware camera solutions running our computer vision pipelines at customers' premises."
    ],
    "badges": [
      "Python",
      "C++",
      "PyTorch",
      "TensorFlow",
      "OpenCV",
      "NumPy",
      "pandas",
      "TensorRT",
      "ONNX",
      "NVIDIA Jetson",
      "FastAPI",
      "Flask",
      "Docker",
      "Docker Compose",
      "AWS",
      "S3",
      "HDR Pipeline",
      "Camera Calibration",
      "MongoDB",
      "Linux",
      "Git",
      "Grafana"
    ]
  },
  {
    "id": "innovatrics",
    "title": "Computer Vision & Machine Learning Engineer",
    "company": "Innovatrics",
    "companyUrl": "https://www.innovatrics.com/",
    "date": "Jan 2017 – Feb 2019",
    "description": [
        "As a core member of the AI research team, I contributed to the development of state-of-the-art face recognition algorithms and biometric identification systems using deep learning frameworks (TensorFlow, PyTorch, Keras). My responsibilities encompassed the entire machine learning pipeline, from implementing data processing workflows and managing datasets to deep learning model optimization and deployment.",
        "I then joined a new team focused on automatic visual inspection, where we transitioned computer vision technology from research to production and manufacturing applications. One of my key contributions was implementing and optimizing Mask R-CNN models for defect detection in ID cards or semantic segmentation of pavement cracks.",
        "This work involved extensive development of CNN segmentation and detection algorithms, creating custom dataset management tools, and building custom annotation frameworks specifically designed for the given tasks."
    ],
    "badges": [
      "Python",
      "TensorFlow",
      "PyTorch",
      "Keras",
      "Face Recognition",
      "Biometric Identification",
      "Computer Vision",
      "Automated Visual Inspection",
      "Defect Detection",
      "OpenCV",
      "NumPy",
      "pandas",
      "scikit-learn",
      "TensorBoard",
      "Mask R-CNN",
      "U-Net",
      "Docker",
      "Linux",
      "Git"
    ]
  },
  {
    "id": "nxp",
    "title": "Computer Vision Engineer",
    "company": "NXP Semiconductors",
    "companyUrl": "https://www.nxp.com/",
    "date": "Jul 2016 – Dec 2017",
    "description": [
        "My main responsibility was the implementation and optimization of computer-vision algorithms for embedded processors such as i.MX6 and i.MX8, primarily targeting ADAS applications. I focused on developing efficient algorithms using OpenCL (GPU) that could leverage the limited computational resources of embedded systems while integrating with camera interfaces.",
        "My biggest achievement was developing an optimized stereo-vision algorithm for depth estimation and 3D reconstruction applications, achieving state-of-the-art real-time FPS performance on an embedded GPGPU. This work involved low-level C++ optimization techniques and parallel computing strategies to maximize performance on resource-constrained hardware."
    ],
    "badges": [
      "C/C++",
      "OpenCL",
      "GPGPU",
      "OpenCV",
      "Stereo Vision",
      "3D Reconstruction",
      "CMake",
      "Linux",
      "Bash",
      "Git",
      "Cross-compilation"
    ]
  }
]

